import { FC } from "react";

interface PortfolioIconProps extends React.SVGProps<SVGSVGElement> {
  className?: string;
}

/**
 * Компонент иконки лоадинга
 * Размеры задаются внешним контейнером через CSS (width/height)
 * @param {PortfolioIconProps} props - Свойства компонента
 * @returns {JSX.Element} SVG иконка
 */
export const PortfolioIcon: FC<PortfolioIconProps> = ({
  className,
  ...props
}) => (
  <svg viewBox="0 0 817 739" fill="none" xmlns="http://www.w3.org/2000/svg">
    <g clip-path="url(#clip0_95_560)">
      <path
        d="M0 336V177C0 171 4 158 19.5 158C33.6012 158 428.408 158 651.771 158L802 158C817 158 817 170.5 817 175V337C817 346.2 817 353.715 802 358C798.5 359 476 444.5 476 444.5V392.5C476 382.5 476 373.5 463 373.5H358C345 373.5 345 383 345 392.5V444.5C243 418 35.4285 362.584 19.5 358.5C0 353.5 0 342 0 336Z"
        fill="#4D7CEF"
      />
      <path
        d="M10 373.5L345 463V523C345 533.5 347 535.554 357 535.5C387.667 535.333 452 535.5 463 535.5C474 535.5 476 534 476 520V461.5L807 375V725C807 730 807 738.5 792.5 738.5H23C10 738.5 10 730 10 723.5V373.5Z"
        fill="#4D7CEF"
      />
      <path
        d="M364.5 507V401.5C364.5 396 367 391 374.5 391H444.5C454.5 391 455.5 397 455.5 401.5V507C455.5 515 451 518 444.5 518H373.5C368 518 364.5 514 364.5 507Z"
        fill="#4D7CEF"
      />
      <path
        d="M83.5 130.5V144H212.5C212.667 142.167 212.5 136.912 212.5 130.5C212.5 123.5 207.5 118.5 201 118.5H94.5C87.3 118.5 83.5 124.5 83.5 130.5Z"
        fill="#4D7CEF"
      />
      <path
        d="M732.074 130.5V144H603.074C602.908 142.167 603.074 136.912 603.074 130.5C603.074 123.5 608.074 118.5 614.574 118.5H721.074C728.274 118.5 732.074 124.5 732.074 130.5Z"
        fill="#4D7CEF"
      />
      <path
        d="M232.001 145.498H279.001V56.4984C279.001 44.8984 287.001 42.9984 291.001 43.4984H526.001C536.401 43.4984 538.668 52.1651 538.501 56.4984V145.498H583.501C584.001 105.498 583.5 22.6619 583.5 11C583.5 -4.48227e-05 575.501 -0.0017806 568.501 -0.0017806L242.5 -0.00195312C242.5 -0.00195312 232 -0.0017767 232.001 10.9982V145.498Z"
        fill="#4D7CEF"
      />
    </g>
    <defs>
      <clipPath id="clip0_95_560">
        <rect
          width="817"
          height="738.502"
          fill="white"
          transform="translate(0 -0.00195312)"
        />
      </clipPath>
    </defs>
  </svg>
);
