export const education = [
  {
    name: "2012",
    title: "МАОУ СОШ № 27 г. Томск",
    description: "полное среднее (11 классов)",
  },
  {
    name: "2020",
    title: "ВИЭСУ (ГМУ) г. Воронеж",
    description: "неоконченное высшее (3 курса)",
  },
  {
    name: "2022",
    title: "MetaLamp (Frontend) г. Томск",
    description: "сертификат № F-0902",
  },
];

export const experience = [
  {
    name: "2013 - 2018",
    title: "Менеджер по работе с клиентами и документами (г. Воронеж)",
    description: "АО “СОГАЗ”, АО “СОГАЗ”, Банк Восточный, ООО “ПГС Проект”",
  },
  {
    name: "2021 - настоящее время",
    title: "Frontend developer (удаленно)",
    description: "MetaLamp (стажировка), Only, Apostro",
  },
];

export const hobby = [
  {
    name: "Изучаю графический дизайн ",
    description:
      "Прохожу обучение в Школе дизайнеров Бюро Горбунова. Очень нравится направление по визуализации данных",
  },
  {
    name: "Интересуюсь нейросетями",
    description: "Пробую работать с разными графическими нейросетями",
  },
  {
    name: "Мечтаю построить дом",
    description:
      "Рисую планировки дома мечты с продумыванием эргономики интерьера и привязкой к участку",
  },
  {
    name: "Музыка",
    description: "В основном слушаю всякий тяжеляк и электронную музыку",
  },
];
