// Types
export interface ExperienceData {
  id: number;
  period: string;
  position: string;
  company: string;
  companyLink: string;
  stack: string;
  description: string;
}

// Experience data
export const EXPERIENCE_DATA: readonly ExperienceData[] = [
  {
    id: 1,
    period: "Март 2023 — Февраль 2025",
    position: "Frontend-разработчик",
    company: "Apostro",
    companyLink: "https://app.apostro.xyz/protocols",
    stack:
      "Стек технологий: TypeScript, Next, React, React Router, styled-components, RxJS.",
    description: `Помогала поддерживать и\u00A0обновлять существующую кодовую базу по\u00A0фронтенду.
Приняла участие в:
    — реализация новых фич:
        рейтинг безопасности финансового сектора,
        поддержка авторизации пользователей;
    — вёрстка таблиц с\u00A0использованием библиотеки MRT (Material React Table);
    — интеграция инструментов DataDog на\u00A0фронтенд;
    — поддержка и\u00A0развитие продуктовых лендингов на\u00A0Webflow;
    — вёрстка электронных писем для пользователей;
    — документирование компонентов с\u00A0помощью storybook;
    — редизайн ресурса в\u00A0части вёрстки компонентов на\u00A0фронтенде;
Последние несколько месяцев дополнительно выполняла задачки по\u00A0дизайну.
Создавала дизайн панели администрирования финансовых данных для аналитика.`,
  },
  {
    id: 2,
    period: "Сентябрь 2022 — Март 2023",
    position: "Frontend-разработчик",
    company: "Only",
    companyLink: "https://only.digital/",
    stack:
      "Стек технологий: TypeScript, Webpack, PUG, SCSS, React, Redux (в зависимости от проекта)",
    description: `В\u00A0рамках испытания при принятии на\u00A0должность выполняла тестовое задание: форма авторизации (стек технологий: React, TypeScript, React Router, styled-components, React Hook Form, RxJS) https://wzdorowa.github.io/authorization/

Участвовала в\u00A0разработке 9\u00A0проектов в\u00A0рамках деятельности в\u00A0компании Only. Проектная работа велась с\u00A0использованием GitLab\u00A0+ Jira.

1. Группа лендингов для промышленной компании построенных на\u00A0идее активного взаимодействия с\u00A0пользователем с\u00A0проработкой интерактивной визуальной составляющей и\u00A0использованием инструментов GSAP и\u00A0Swiper (основной стек: Webpack, PUG, SCSS, TS). Мой вклад: верстка новых блоков с\u00A0анимацией и\u00A0адаптивом, доработка существующих блоков, багфикс.

2. Многостраничный сайт промышленной компании (основной стек: Webpack, PUG, SCSS, TS). Мой вклад: добавление кастомного компонента дропдауна с\u00A0возможностью выбора нескольких значений через чекбоксы в\u00A0выпадающем списке и\u00A0прокидыванием выбранных значений в\u00A0плейсхолдер дропдауна.

3. Лендинг для демонстрации жилого комплекса от\u00A0застройщика (основной стек: Webpack, PUG, SCSS, TS). Мой вклад: верстка новых блоков с\u00A0адаптивом (статичные блоки или\u00A0блоки со\u00A0слайдером с\u00A0использованием Swiper), доработка существующих блоков, багфикс.

4. Информационный портал для торговой площадки (около 250\u00A0страниц) с\u00A0использованием мультиязычности (основной стек: React, Redux, Next, TS). Мой вклад: сборка страниц из\u00A0заранее продуманных и\u00A0написанных компонентов, работа с\u00A0контентной частью (добавление, редактирование), багфикс по\u00A0компонентам, работа с\u00A0формами, проверка работы форм через инструмент Postman, работа с\u00A0запросами к\u00A0бекэнду заказчика, работа с\u00A0API YouTube, работа с\u00A0API hh.ru.

5. Основной сайт для телекоммуникационной компании, предоставляющей услуги магистрального оператора связи (основной стек: Next, React, Redux Toolkit, TS). Мой вклад: поддержка легаси кода. Доработка формы обратной связи, путем нахождения ip\u00A0адреса пользователя и\u00A0отправление его на\u00A0бэкенд вместе с\u00A0данными формы, для дальнейшей возможности настройки спам-отбора. Добавление в\u00A0форму Google reCAPTCHA. Проверка работы формы через инструмент Postman.

6. Лэндинг для телекоммуникационной компании, предоставляющей услуги магистрального оператора связи (основной стек: Next, React, Redux Toolkit, TS). Мой вклад: поддержка легаси кода. Правка вёрстки. Правка стилей.

7. Сайт для компании по\u00A0разработке и\u00A0производству средств автоматизации объектов добычи, транспорта и\u00A0распределения газа (основной стек: Next, React, TS). Мой вклад: Поддержка легаси кода. Правка контента. Добавила редирект с\u00A0одного домена на\u00A0другой.

8. Интернет-магазин мебели. (Основной стек: Webpack, PUG, SCSS, JS). Мой вклад: Поддержка легаси кода. Правка вёрстки. Правка стилей.

9. Сайт для оператора платной дороги. (Основной стек: Webpack, PUG, SCSS, TS). Мой вклад: верстка новых блоков с\u00A0адаптивом.`,
  },
  {
    id: 3,
    period: "Январь 2022 — Июль 2022",
    position: "Frontend-разработчик",
    company: "MetaLamp",
    companyLink: "https://metalamp.ru/",
    stack:
      "Стек технологий: JavaScript, TypeScript, JQuery, Parcel, SCSS, Pug, Jest.",
    description: `Вёрстка сайта:
https://wzdorowa.github.io/TOXIN (демка)
  — Компонентная адаптивная вёрстка с\u00A0использованием Pug и\u00A0SCSS по\u00A0методологии БЭМ.
  — Поиск, подключение и\u00A0настройка JavaScript-библиотек и\u00A0jQuery-плагинов.
  — Осуществление сборки c\u00A0помощью Parcel.

Разработка JQuery-слайдера:
https://wzdorowa.github.io/jQuery-slider (демка)
  — Создание проекта с\u00A0использованием паттернов MVC и\u00A0Observer и\u00A0Facade.
  — Разделение конфигурирования и\u00A0бизнес-логики.
  — Написание документации (описание заложенной архитектуры, визуализация её через UML-диаграммы).
  — Написание unit-тестов.`,
  },
] as const;
