// Page content constants
export const EXPERIENCE_PAGE_CONTENT = {
  title: "Опыт работы",
  subtitle: [
    "Несколько лет назад я выбрала путь стать фронтенд-разработчиком. Это был нелёгкий путь, который помог мне понять, чем я действительно хочу заниматься в\u00A0профессиональной среде. И\u00A0я решила, что буду пробовать себя в\u00A0роли дизайнера интерфейсов.",
    "В\u00A0настоящий момент ищу работу в\u00A0направлении проектирования интерфейсов. Хочу найти применение своим навыкам в\u00A0продуктовой компании и\u00A0вместе с\u00A0тем продолжать развиваться в\u00A0профессии.",
    "Если вам интересен мой опыт, дайте мне об\u00A0этом знать, удобным для вас способом.",
  ],
  resumeLink: "/documents/resume.pdf",
  portfolioLink: "/portfolio",
  dropdownTitle: "Что делала?",
  resumeText: "Скачать резюме",
  portfolioText: "Посмотреть портфолио",
} as const;
