// Types
export interface ExperienceData {
  id: number;
  period: string;
  position: string;
  company: string;
  companyLink: string;
  stack: string;
  description: string;
}

// Experience data
export const EXPERIENCE_DATA: readonly ExperienceData[] = [
  {
    id: 1,
    period: "Март 2023 — Февраль 2025",
    position: "Frontend-разработчик",
    company: "Apostro",
    companyLink: "https://app.apostro.xyz/protocols",
    stack:
      "Стек технологий: TypeScript, Next, React, React Router, styled-components, RxJS.",
    description: `Помогала поддерживать и обновлять существующую кодовую базу по фронтенду.
Приняла участие в:
    — реализация новых фич:
        свитчер сетей,
        рейтинг безопасности финансового сектора,
        поддержка авторизации пользователей;
    — вёрстка таблиц с использованием библиотеки MRT (Material React Table);
    — интеграция инструментов DataDog на фронтенд;
    — поддержка и развитие продуктовых лендингов на Webflow;
    — вёрстка электронных писем для пользователей;
    — документирование компонентов с помощью storybook;
    — редизайн ресурса в части вёрстки компонентов на фронтенде;
Последние несколько месяцев дополнительно выполняла задачки по дизайну.
Создавала дизайн панели администрирования финансовых данных для аналитика.`,
  },
  {
    id: 2,
    period: "Сентябрь 2022 — Март 2023",
    position: "Frontend-разработчик",
    company: "Only",
    companyLink: "https://only.digital/",
    stack:
      "Стек технологий: TypeScript, Webpack, PUG, SCSS, React, Redux (в зависимости от проекта)",
    description: `В рамках испытания при принятии на должность выполняла тестовое задание: форма авторизации (стек технологий: React, TypeScript, React Router, styled-components, React Hook Form, RxJS) https://wzdorowa.github.io/authorization/

Участвовала в разработке 9 проектов в рамках деятельности в компании Only. Проектная работа велась с использованием GitLab + Jira.

1: Группа лендингов для промышленной компании построенных на идее активного взаимодействия с пользователем с проработкой интерактивной визуальной составляющей и использованием инструментов GSAP и Swiper (основной стек: Webpack, PUG, SCSS, TS). Мой вклад: верстка новых блоков с анимацией и адаптивом, доработка существующих блоков, багфикс.

2: Многостраничный сайт промышленной компании (основной стек: Webpack, PUG, SCSS, TS). Мой вклад: добавление кастомного компонента дропдауна с возможностью выбора нескольких значений через чекбоксы в выпадающем списке и прокидыванием выбранных значений в плейсхолдер дропдауна.

3: Лендинг для демонстрации жилого комплекса от застройщика (основной стек: Webpack, PUG, SCSS, TS). Мой вклад: верстка новых блоков с адаптивом (статичные блоки или блоки со слайдером с использованием Swiper), доработка существующих блоков, багфикс.

4: Информационный портал для торговой площадки (около 250 страниц) с использованием мультиязычности (основной стек: React, Redux, Next, TS). Мой вклад: сборка страниц из заранее продуманных и написанных компонентов, работа с контентной частью (добавление, редактирование), багфикс по компонентам, работа с формами, проверка работы форм через инструмент Postman, работа с запросами к бекэнду заказчика, работа с API YouTube, работа с API hh.ru.

5. Основной сайт для телекоммуникационной компании, предоставляющей услуги магистрального оператора связи (основной стек: Next, React, Redux Toolkit, TS). Мой вклад: поддержка легаси кода. Доработка формы обратной связи, путем нахождения ip адреса пользователя и отправление его на бэкенд вместе с данными формы, для дальнейшей возможности настройки спам-отбора. Добавление в форму Google reCAPTCHA. Проверка работы формы через инструмент Postman.

6. Лэндинг для телекоммуникационной компании, предоставляющей услуги магистрального оператора связи (основной стек: Next, React, Redux Toolkit, TS). Мой вклад: поддержка легаси кода. Правка вёрстки. Правка стилей.

7. Сайт для компании по разработке и производству средств автоматизации объектов добычи, транспорта и распределения газа (основной стек: Next, React, TS). Мой вклад: Поддержка легаси кода. Правка контента. Добавила редирект с одного домена на другой.

8. Интернет-магазин мебели. (Основной стек: Webpack, PUG, SCSS, JS). Мой вклад: Поддержка легаси кода. Правка вёрстки. Правка стилей.

9. Сайт для оператора платной дороги. (Основной стек: Webpack, PUG, SCSS, TS). Мой вклад: верстка новых блоков с адаптивом.`,
  },
  {
    id: 3,
    period: "Январь 2022 — Июль 2022",
    position: "Frontend-разработчик",
    company: "MetaLamp",
    companyLink: "https://metalamp.ru/",
    stack:
      "Стек технологий: JavaScript, TypeScript, JQuery, Parcel, SCSS, Pug, Jest.",
    description: `Вёрстка сайта:
https://wzdorowa.github.io/TOXIN (демка)
  — Компонентная адаптивная вёрстка с использованием Pug и SCSS по методологии БЭМ.
  — Поиск, подключение и настройка JavaScript-библиотек и jQuery-плагинов.
  — Осуществление сборки c помощью Parcel.

Разработка JQuery-слайдера:
https://wzdorowa.github.io/jQuery-slider (демка)
  — Создание проекта с использованием паттернов MVC и Observer и Facade.
  — Разделение конфигурирования и бизнес-логики.
  — Написание документации (описание заложенной архитектуры, визуализация её через UML-диаграммы).
  — Написание unit-тестов.`,
  },
] as const;
